anishshriram/esp32-csi-sensor/firmware/sdkconfig.defaults.tx
# esp-csi csi_send (TRANSMITTER) -- Kconfig-level settings, Phase 1.
# Merged into the example's own sdkconfig.defaults by scripts/build_firmware.sh.
# Channel, bandwidth, and 100 Hz send rate come from firmware/patches/ and the
# example's CONFIG_SEND_FREQUENCY #define.

CONFIG_IDF_TARGET="esp32"

CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
CONFIG_ESPTOOLPY_MONITOR_BAUD=921600

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
